<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Creates a signed package for the Network Time Reset solution.</string>
	<key>Identifier</key>
	<string>corp.sap.maccoe.sign.network-time-reset</string>
	<key>Input</key>
	<dict>
		<key>SIGNINGCERTIFICATE</key>
		<string>Put in AutoPkg recipe override</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.5.0</string>
	<key>ParentRecipe</key>
	<string>corp.sap.maccoe.pkg.network-time-reset</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pkg_path%</string>
				<key>signing_cert</key>
				<string>%SIGNINGCERTIFICATE%</string>
			</dict>
			<key>Processor</key>
			<string>corp.sap.autopkg.SharedProcessors/PkgSigner</string>
		</dict>
	</array>
</dict>
</plist>
