<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Creates a package for the Network Time Reset solution.</string>
	<key>Identifier</key>
	<string>corp.sap.maccoe.pkg.network-time-reset</string>
	<key>Input</key>
	<dict>
		<key>BUNDLE_ID</key>
		<string>Put in AutoPkg recipe override</string>
		<key>NAME</key>
		<string>Network Time Reset</string>
		<key>SOFTWARETITLE1</key>
		<string>Network</string>
		<key>SOFTWARETITLE2</key>
		<string>Time</string>
		<key>SOFTWARETITLE3</key>
		<string>Reset</string>
		<key>VENDOR</key>
		<string>Put in AutoPkg recipe override</string>
<!--
        <key>SOLUTION_FILE_PATTERN</key>
		<string>Put in AutoPkg recipe override</string>
 -->
 		<key>SOLUTION_FILE_PATH</key>
		<string>Put in AutoPkg recipe override</string>
		<key>SOLUTION_FILE_SOURCE</key>
		<string>Put in AutoPkg recipe override</string>
		<key>SOLUTION_FILE_MODE</key>
		<string>0755</string>
		<key>SOLUTION_FILE_INFO_PATH</key>
		<string>Put in AutoPkg recipe override</string>
		<key>SOLUTION_FILE_INFO_SOURCE</key>
		<string>Put in AutoPkg recipe override</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.5.0</string>
	<key>Process</key>
	<array>
<!--
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pattern</key>
				<string>%SOLUTION_FILE_PATTERN%</string>
			</dict>
			<key>Processor</key>
			<string>FileFinder</string>
		</dict>
 -->
 		<dict>
			<key>Arguments</key>
			<dict>
				<key>file_path</key>
				<string>%SOLUTION_FILE_INFO_PATH%</string>
				<key>file_content</key>
				<string>%SOLUTION_FILE_INFO_SOURCE%</string>
			</dict>
			<key>Processor</key>
			<string>FileCreator</string>
		</dict>
 		<dict>
			<key>Arguments</key>
			<dict>
				<key>file_path</key>
				<string>%SOLUTION_FILE_PATH%</string>
				<key>file_content</key>
				<string>%SOLUTION_FILE_SOURCE%</string>
				<key>file_mode</key>
				<string>%SOLUTION_FILE_MODE%</string>
			</dict>
			<key>Processor</key>
			<string>FileCreator</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_plist_path</key>
				<string>%SOLUTION_FILE_INFO_PATH%</string>
				<key>plist_version_key</key>
				<string>CFBundleShortVersionString</string>
			</dict>
			<key>Processor</key>
			<string>Versioner</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pattern</key>
				<string>%SOLUTION_FILE_PATH%</string>
			</dict>
			<key>Processor</key>
			<string>FileFinder</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkgdirs</key>
				<dict>
					<key>usr</key>
					<string>%SOLUTION_FILE_MODE%</string>
					<key>usr/local</key>
					<string>%SOLUTION_FILE_MODE%</string>
					<key>usr/local/bin</key>
					<string>%SOLUTION_FILE_MODE%</string>
				</dict>
				<key>pkgroot</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%</string>
			</dict>
			<key>Processor</key>
			<string>PkgRootCreator</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%pkgroot%/usr/local/bin/%found_basename%</string>
				<key>overwrite</key>
				<true/>
				<key>source_path</key>
				<string>%found_filename%</string>
			</dict>
			<key>Processor</key>
			<string>Copier</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_request</key>
				<dict>
					<key>chown</key>
					<array>
						<dict>
							<key>group</key>
							<string>wheel</string>
							<key>mode</key>
							<string>%SOLUTION_FILE_MODE%</string>
							<key>path</key>
							<string>usr</string>
							<key>user</key>
							<string>root</string>
						</dict>
						<dict>
							<key>group</key>
							<string>wheel</string>
							<key>mode</key>
							<string>%SOLUTION_FILE_MODE%</string>
							<key>path</key>
							<string>usr/local</string>
							<key>user</key>
							<string>root</string>
						</dict>
						<dict>
							<key>group</key>
							<string>wheel</string>
							<key>mode</key>
							<string>%SOLUTION_FILE_MODE%</string>
							<key>path</key>
							<string>usr/local/bin</string>
							<key>user</key>
							<string>root</string>
						</dict>
						<dict>
							<key>group</key>
							<string>wheel</string>
							<key>mode</key>
							<string>%SOLUTION_FILE_MODE%</string>
							<key>path</key>
							<string>usr/local/bin/%found_basename%</string>
							<key>user</key>
							<string>root</string>
						</dict>
					</array>
					<key>id</key>
					<string>%BUNDLE_ID%</string>
					<key>options</key>
					<string>purge_ds_store</string>
					<key>pkgname</key>
					<string>%VENDOR%_%SOFTWARETITLE1%_%SOFTWARETITLE2%_%SOFTWARETITLE3%_%version%</string>
					<key>pkgroot</key>
					<string>%RECIPE_CACHE_DIR%/%NAME%</string>
					<key>version</key>
					<string>%version%</string>
				</dict>
			</dict>
			<key>Processor</key>
			<string>PkgCreator</string>
		</dict>
	</array>
</dict>
</plist>
