<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
   <dict>
      <key>Description</key>
      <string>Downloads the latest version of Maccy.</string>
      <key>Identifier</key>
      <string>corp.sap.maccoe.download.Maccy</string>
      <key>Input</key>
      <dict>
         <key>NAME</key>
         <string>Maccy</string>
         <key>SOFTWARETITLE</key>
         <string>Maccy</string>
      </dict>
      <key>MinimumVersion</key>
      <string>1.0.0</string>
      <key>Process</key>
      <array>
         <dict>
            <key>Arguments</key>
            <dict>
               <key>appcast_url</key>
               <string>https://raw.githubusercontent.com/p0deje/Maccy/master/appcast.xml</string>
            </dict>
            <key>Processor</key>
            <string>SparkleUpdateInfoProvider</string>
         </dict>
         <dict>
            <key>Arguments</key>
            <dict>
               <key>filename</key>
               <string>%SOFTWARETITLE%-%version%.zip</string>
            </dict>
            <key>Processor</key>
            <string>URLDownloader</string>
         </dict>
         <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
         </dict>
         <dict>
            <key>Arguments</key>
            <dict>
               <key>archive_path</key>
               <string>%pathname%</string>
               <key>destination_path</key>
               <string>%RECIPE_CACHE_DIR%/%SOFTWARETITLE%</string>
               <key>purge_destination</key>
               <true />
            </dict>
            <key>Processor</key>
            <string>Unarchiver</string>
         </dict>
         <dict>
            <key>Arguments</key>
            <dict>
               <key>input_path</key>
               <string>%RECIPE_CACHE_DIR%/%SOFTWARETITLE%/Maccy.app</string>
               <key>requirement</key>
               <string>anchor apple generic and identifier "org.p0deje.Maccy" and (certificate leaf[field.1.2.840.113635.100.6.1.9] /* exists */ or certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = MN3X4648SC)</string>
            </dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
         </dict>
      </array>
   </dict>
</plist>