<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
   <dict>
      <key>Description</key>
      <string>Downloads the current release version of AceBIT PasswordDepot for Mac and builds an installer package.</string>
      <key>Identifier</key>
      <string>corp.sap.maccoe.pkg.passworddepot</string>
      <key>Input</key>
      <dict>
         <key>NAME</key>
         <string>PasswordDepot</string>
         <key>PACKAGER</key>
         <string>SAPCorp</string>
         <key>VENDOR</key>
         <string>AceBIT</string>
         <key>SOFTWARETITLE</key>
         <string>PasswordDepot</string>
      </dict>
      <key>MinimumVersion</key>
      <string>1.0.0</string>
      <key>ParentRecipe</key>
      <string>corp.sap.maccoe.download.passworddepot</string>
      <key>Process</key>
      <array>
         <dict>
             <key>Processor</key>
             <string>AppDmgVersioner</string>
             <key>Arguments</key>
             <dict>
                 <key>dmg_path</key>
                 <string>%pathname%</string>
                 <key>destination_path</key>
                 <true/>
             </dict>
         </dict>
         <dict>
            <key>Processor</key>
            <string>PkgRootCreator</string>
            <key>Arguments</key>
            <dict>
               <key>pkgroot</key>
               <string>%RECIPE_CACHE_DIR%/pkgroot</string>
               <key>pkgdirs</key>
               <dict>
                  <key>Applications</key>
                  <string>0775</string>
                  <key>Scripts</key>
                  <string>0775</string>
               </dict>
            </dict>
         </dict>
         <dict>
            <key>Processor</key>
            <string>FileMover</string>
            <key>Arguments</key>
            <dict>
               <key>source</key>
               <string>%RECIPE_CACHE_DIR%/pkgroot/Scripts</string>
               <key>target</key>
               <string>%RECIPE_CACHE_DIR%/Scripts</string>
            </dict>
         </dict>
         <dict>
            <key>Processor</key>
            <string>FileCreator</string>
            <key>Arguments</key>
            <dict>
               <key>file_path</key>
               <string>%RECIPE_CACHE_DIR%/Scripts/preinstall</string>
               <key>file_mode</key>
               <string>0755</string>
               <key>file_content</key>
               <string>#!/bin/bash

# postinstall.sh, 0.1.2
# (c) 2022, SAP SE (Rich Trouton &lt;rich.trouton@sap.com&gt;)

# latest change:
# 2022/02/14, Rich Trouton &lt;rich.trouton@sap.com&gt;

ERROR=0

/bin/rm -rf "$3/Applications/Password Depot"*.app

exit $ERROR</string>
            </dict>
         </dict>
         <dict>
            <key>Arguments</key>
            <dict>
               <key>pattern</key>
               <string>%pathname%/*.app</string>
            </dict>
            <key>Processor</key>
            <string>FileFinder</string>
         </dict>
         <dict>
            <key>Processor</key>
            <string>Copier</string>
            <key>Arguments</key>
            <dict>
               <key>source_path</key>
               <string>%pathname%/%dmg_found_filename%</string>
               <key>destination_path</key>
               <string>%pkgroot%/Applications/%dmg_found_filename%</string>
            </dict>
         </dict>
         <dict>
            <key>Processor</key>
            <string>PkgCreator</string>
            <key>Arguments</key>
            <dict>
               <key>pkgname</key>
               <string>%PACKAGER%_%VENDOR%_%SOFTWARETITLE%_%version%</string>
               <key>pkg_request</key>
               <dict>
                  <key>version</key>
                  <string>%version%</string>
                  <key>id</key>
                  <string>acebit.passworddepot.osx</string>
                  <key>options</key>
                  <string>purge_ds_store</string>
                  <key>scripts</key>
                  <string>Scripts</string>
                  <key>chown</key>
                  <array>
                     <dict>
                        <key>path</key>
                        <string>Applications</string>
                        <key>user</key>
                        <string>root</string>
                        <key>group</key>
                        <string>wheel</string>
                     </dict>
                  </array>
               </dict>
            </dict>
         </dict>
         <dict>
            <key>Arguments</key>
            <dict>
               <key>path_list</key>
               <array>
                  <string>%RECIPE_CACHE_DIR%/pkgroot</string>
                  <string>%RECIPE_CACHE_DIR%/Scripts</string>
               </array>
            </dict>
            <key>Processor</key>
            <string>PathDeleter</string>
         </dict>
      </array>
   </dict>
</plist>