<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
   <dict>
      <key>Description</key>
      <string>Downloads latest Balsamiq Wireframes disk image and builds a package.</string>
      <key>Identifier</key>
      <string>corp.sap.maccoe.pkg.BalsamiqWireframes</string>
      <key>Input</key>
      <dict>
         <key>NAME</key>
         <string>Balsamiq Wireframes</string>
         <key>PACKAGER</key>
         <string>SAPCorp</string>
         <key>VENDOR</key>
         <string>Balsamiq</string>
         <key>SOFTWARETITLE</key>
         <string>Wireframes</string>
         <key>BALSAMIQ_WIREFRAMES_KEY</key>
         <string>Put_Balsamiq_Wireframes_Key_into_AutoPkg_recipe_override</string>
      </dict>
      <key>ParentRecipe</key>
      <string>com.github.dataJAR-recipes.download.Balsamiq Wireframes 4</string>
      <key>Process</key>
      <array>
         <dict>
            <key>Arguments</key>
            <dict>
               <key>predicate</key>
               <string>BALSAMIQ_WIREFRAMES_KEY == "Put_Balsamiq_Wireframes_Key_into_AutoPkg_recipe_override"</string>
            </dict>
            <key>Processor</key>
            <string>StopProcessingIf</string>
         </dict>
         <dict>
            <key>Processor</key>
            <string>AppDmgVersioner</string>
            <key>Arguments</key>
            <dict>
               <key>dmg_path</key>
               <string>%pathname%</string>
            </dict>
         </dict>
         <dict>
            <key>Processor</key>
            <string>PkgRootCreator</string>
            <key>Arguments</key>
            <dict>
               <key>pkgroot</key>
               <string>%RECIPE_CACHE_DIR%/Scripts</string>
               <key>pkgdirs</key>
               <dict />
            </dict>
         </dict>
         <dict>
            <key>Processor</key>
            <string>PkgRootCreator</string>
            <key>Arguments</key>
            <dict>
               <key>pkgroot</key>
               <string>%RECIPE_CACHE_DIR%/%NAME%</string>
               <key>pkgdirs</key>
               <dict>
                  <key>Applications</key>
                  <string>0775</string>
               </dict>
            </dict>
         </dict>
         <dict>
            <key>Processor</key>
            <string>Copier</string>
            <key>Arguments</key>
            <dict>
               <key>source_path</key>
               <string>%pathname%/%app_name%</string>
               <key>destination_path</key>
               <string>%pkgroot%/Applications/%app_name%</string>
            </dict>
         </dict>
         <dict>
            <key>Processor</key>
            <string>FileCreator</string>
            <key>Arguments</key>
            <dict>
               <key>file_path</key>
               <string>%RECIPE_CACHE_DIR%/Scripts/postinstall</string>
               <key>file_mode</key>
               <string>0755</string>
               <key>file_content</key>
               <string>#!/bin/bash

# Balsamiq Wireframes is licensed at the user-level, so we need to detect
# who is logged in and apply the licensing for that user. If nobody is logged
# in, do not apply the licensing.

logged_in_user=$(scutil &lt;&lt;&lt; "show State:/Users/ConsoleUser" | awk '/Name :/  { print $3 }')

license_key='%BALSAMIQ_WIREFRAMES_KEY%'

# Register Balsamiq Wireframes for the logged-in user with the current license key

if [[ -x "$3/Applications/Balsamiq Wireframes.app" ]] &#38;&#38; [[ -n "$logged_in_user" ]]; then
  sudo -u "$logged_in_user" "$3/Applications/Balsamiq Wireframes.app/Contents/MacOS/Balsamiq Wireframes" --register $(printf ${license_key})
fi

exit 0</string>
            </dict>
         </dict>
         <dict>
            <key>Processor</key>
            <string>PkgCreator</string>
            <key>Arguments</key>
            <dict>
               <key>pkg_request</key>
               <dict>
                  <key>pkgname</key>
                  <string>%PACKAGER%_%VENDOR%_%SOFTWARETITLE%_%version%</string>
                  <key>version</key>
                  <string>%version%</string>
                  <key>id</key>
                  <string>com.balsamiq.wireframes.project.pkg</string>
                  <key>options</key>
                  <string>purge_ds_store</string>
                  <key>scripts</key>
                  <string>Scripts</string>
                  <key>chown</key>
                  <array>
                     <dict>
                        <key>path</key>
                        <string>Applications</string>
                        <key>user</key>
                        <string>root</string>
                        <key>group</key>
                        <string>admin</string>
                     </dict>
                  </array>
               </dict>
            </dict>
         </dict>
         <dict>
            <key>Processor</key>
            <string>PathDeleter</string>
            <key>Arguments</key>
            <dict>
               <key>path_list</key>
               <array>
                  <string>%RECIPE_CACHE_DIR%/%NAME%</string>
                  <string>%RECIPE_CACHE_DIR%/Scripts</string>
               </array>
            </dict>
         </dict>
      </array>
   </dict>
</plist>