<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v2.3.1 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Downloads the latest version of Busylight4MSTeams and uploads the package to Jamf.</string>
	<key>Identifier</key>
	<string>corp.sap.maccoe.jamf.Busylight4MSTeams</string>
	<key>Input</key>
	<dict>
		<key>CATEGORY</key>
		<string>Apps</string>
		<key>DOWNLOADURL</key>
		<string>https://www.plenom.com/download/154724</string>
		<key>NAME</key>
		<string>Busylight4MSTeams</string>
		<key>PKG_CATEGORY</key>
		<string>%CATEGORY%</string>
		<key>POLICY_CATEGORY</key>
		<string>Apps-AutoUpdate</string>
		<key>POLICY_NAME</key>
		<string>macOS-I052599-202505: Auto Update %PROD_NAME%</string>
		<key>POLICY_TEMPLATE</key>
		<string>PolicyTemplate-autoupdate.xml</string>
		<key>POLICY_TRIGGER</key>
		<string>autoupdate-%PROD_NAME%</string>
		<key>PROD_NAME</key>
		<string>Busylight4MSTeams</string>
		<key>SLEEP_IN_SECONDS</key>
		<string>0</string>
		<key>SOFTWARETITLE1</key>
		<string>Busylight</string>
		<key>SOFTWARETITLE2</key>
		<string>for</string>
		<key>SOFTWARETITLE3</key>
		<string>Microsoft</string>
		<key>SOFTWARETITLE4</key>
		<string>Teams</string>
		<key>STOPPROCESSINGIF_PREDICATE1</key>
		<string>download_changed == FALSE</string>
		<key>STOPPROCESSINGIF_PREDICATE2</key>
		<string>pkg_uploaded == FALSE</string>
		<key>VENDOR</key>
		<string>Plenom</string>
	</dict>
	<key>MinimumVersion</key>
	<string>2.3</string>
	<key>ParentRecipe</key>
	<string>com.github.rtrouton.pkg.Busylight4MSTeams</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>predicate</key>
				<string>%STOPPROCESSINGIF_PREDICATE1%</string>
			</dict>
			<key>Processor</key>
			<string>StopProcessingIf</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>category_name</key>
				<string>%CATEGORY%</string>
			</dict>
			<key>Processor</key>
			<string>com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_category</key>
				<string>%PKG_CATEGORY%</string>
			</dict>
			<key>Processor</key>
			<string>com.github.grahampugh.jamf-upload.processors/JamfPackageUploader</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>predicate</key>
				<string>%STOPPROCESSINGIF_PREDICATE2%</string>
			</dict>
			<key>Processor</key>
			<string>StopProcessingIf</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>sleep_seconds</key>
				<string>%SLEEP_IN_SECONDS%</string>
			</dict>
			<key>Processor</key>
			<string>corp.sap.autopkg.SharedProcessors/Sleep</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>category_name</key>
				<string>%POLICY_CATEGORY%</string>
			</dict>
			<key>Processor</key>
			<string>com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>policy_name</key>
				<string>%POLICY_NAME%</string>
				<key>policy_template</key>
				<string>%POLICY_TEMPLATE%</string>
				<key>replace_policy</key>
				<string>True</string>
			</dict>
			<key>Processor</key>
			<string>com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader</string>
		</dict>
	</array>
</dict>
</plist>
