<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
   <dict>
      <key>Description</key>
      <string>Uses parent pkg recipe to download the latest Microsoft Word installer package and import it into the Jamf Pro server, then updates related Policies, Categories, Smart Groups with the latest information.</string>
      <key>Identifier</key>
      <string>corp.sap.maccoe.jamf.MicrosoftWord-App-AutoUpdate-AllObjects</string>
      <key>Input</key>
      <dict>
         <key>NAME</key>
         <string>Microsoft Word</string>
         <key>CATEGORY</key>
         <string>Apps</string>
         <key>PKG_CATEGORY</key>
         <string>%CATEGORY%</string>
         <key>PROD_NAME</key>
         <string>MicrosoftWord</string>
         <key>POLICY_NAME</key>
         <string></string>
         <key>POLICY_CATEGORY</key>
         <string>Apps-AutoUpdate</string>
         <key>POLICY_TEMPLATE</key>
         <string>PolicyTemplate-autoupdate.xml</string>
         <key>POLICY_TEMPLATE_VPP_APP_REPLACEMENT_SELFSERVICE</key>
         <string>PolicyTemplate-SelfService-VPP-app-replacement.xml</string>
         <key>POLICY_TEMPLATE_VPP_APP_REPLACEMENT_INSTALL</key>
         <string>PolicyTemplate-SelfService-VPP-app-replacement-install.xml</string>
         <key>POLICY_TEMPLATE_VPP_APP_REPLACEMENT_CACHE</key>
         <string>PolicyTemplate-PushDeployment-VPP-app-replacement-cache.xml</string>
         <key>POLICY_TEMPLATE_VPP_APP_REPLACEMENT_INSTALL_CACHED</key>
         <string>PolicyTemplate-PushDeployment-VPP-app-replacement-install-cached.xml</string>
         <key>GROUP_TEMPLATE_OUTDATED_APP</key>
         <string>SmartGroupTemplate-app-outdated.xml</string>
         <key>GROUP_TEMPLATE_VPP_APP_REPLACEMENT_CACHED</key>
         <string>SmartGroupTemplate-VPP-app-replacement-cached.xml</string>
         <key>GROUP_TEMPLATE_VPP_APP_REPLACEMENT_NOT_CACHED</key>
         <string>SmartGroupTemplate-VPP-app-replacement-not-cached.xml</string>         
         <key>POLICY_TRIGGER</key>
         <string>autoupdate-%PROD_NAME%</string>
         <key>SLEEP_IN_SECONDS</key>
         <string>0</string>
         <key>STOPPROCESSINGIF_PREDICATE1</key>
         <string>download_changed == FALSE</string>
         <key>STOPPROCESSINGIF_PREDICATE2</key>
         <string>pkg_uploaded == FALSE</string>
         <key>POLICY_NAME_VPP_APP_REPLACEMENT_SELFSERVICE</key>
         <string></string>
         <key>POLICY_DISPLAY_NAME_VPP_APP_REPLACEMENT_SELFSERVICE</key>
         <string>%NAME%</string>
         <key>POLICY_DISPLAY_NAME_VPP_APP_REPLACEMENT_INSTALL</key>
         <string>%NAME%</string>
         <key>POLICY_NAME_VPP_APP_REPLACEMENT_INSTALL</key>
         <string></string>
         <key>POLICY_NAME_VPP_APP_REPLACEMENT_CACHE</key>
         <string></string>
         <key>POLICY_NAME_VPP_APP_REPLACEMENT_INSTALL_CACHED</key>
         <string></string>
         <key>GROUP_NAME_NONCOMPLIANT</key>
         <string></string>
         <key>GROUP_NAME_VPP_APP_REPLACEMENT_CACHED</key>
         <string></string>
         <key>GROUP_NAME_VPP_APP_REPLACEMENT_NOT_CACHED</key>
         <string></string>
         <key>POLICY_DESCRIPTION_VPP_APP_REPLACEMENT_SELFSERVICE</key>
         <string></string>
         <key>POLICY_DESCRIPTION_VPP_APP_REPLACEMENT_INSTALL</key>
         <string></string>
         <key>TRIGGER_O1_VPP_APP_REPLACEMENT</key>
         <string></string>
         <key>TRIGGER_O2_VPP_APP_REPLACEMENT</key>
         <string></string>
         <key>TRIGGER_O3_VPP_APP_REPLACEMENT</key>
         <string></string>
         <key>TRIGGER_VPP_APP_REPLACEMENT_SELFSERVICE</key>
         <string></string>
         <key>TRIGGER_VPP_APP_REPLACEMENT_PUSH_DEPLOYMENT</key>
         <string></string>
         <key>GROUP_NAME_INSTALLED_APP</key>
         <string></string>
         <key>GROUP_NAME_OUTDATED_APP</key>
         <string></string>
         <key>GROUP_NAME_VPP_APP_REPLACEMENT</key>
         <string></string>
         <key>GROUP_NAME_STORAGE_AMOUNT</key>
         <string></string>
         <key>GROUP_NAME_STORAGE_PERCENT</key>
         <string></string>
         <key>EA_NAME_VPP_APP_INFO</key>
         <string></string>         
         <key>EA_REGEX_VPP_APP_INFO</key>
         <string></string>         
         <key>APP_BUNDLE_ID</key>
         <string>com.microsoft.Word</string>         
      </dict>
      <key>MinimumVersion</key>
      <string>2.0.0</string>
      <key>ParentRecipe</key>
      <string>corp.sap.maccoe.pkg.microsoftword365</string>
      <key>Process</key>
      <array>
         <dict>
            <key>Arguments</key>
            <dict>
               <key>predicate</key>
               <string>%STOPPROCESSINGIF_PREDICATE1%</string>
            </dict>
            <key>Processor</key>
            <string>StopProcessingIf</string>
         </dict>
         <dict>
            <key>Arguments</key>
            <dict>
               <key>category_name</key>
               <string>%CATEGORY%</string>
            </dict>
            <key>Processor</key>
            <string>com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader</string>
         </dict>
         <dict>
            <key>Arguments</key>
            <dict>
               <key>pkg_category</key>
               <string>%PKG_CATEGORY%</string>
               <key>pkg_notes</key>
               <string>%NAME% %version% installer uploaded via AutoPkg.</string>
            </dict>
            <key>Processor</key>
            <string>com.github.grahampugh.jamf-upload.processors/JamfPackageUploader</string>
         </dict>
         <dict>
            <key>Arguments</key>
            <dict>
               <key>predicate</key>
               <string>%STOPPROCESSINGIF_PREDICATE2%</string>
            </dict>
            <key>Processor</key>
            <string>StopProcessingIf</string>
         </dict>
         <dict>
            <key>Processor</key>
            <string>corp.sap.autopkg.SharedProcessors/Sleep</string>
            <key>Arguments</key>
            <dict>
               <key>sleep_seconds</key>
               <string>%SLEEP_IN_SECONDS%</string>
            </dict>
         </dict>
         <dict>
            <key>Arguments</key>
            <dict>
               <key>category_name</key>
               <string>%POLICY_CATEGORY%</string>
            </dict>
            <key>Processor</key>
            <string>com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader</string>
         </dict>
         <dict>
            <key>Arguments</key>
            <dict>
               <key>category_name</key>
               <string>Push Deployments</string>
            </dict>
            <key>Processor</key>
            <string>com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader</string>
         </dict>
         <dict>
            <key>Processor</key>
            <string>com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader</string>
            <key>Arguments</key>
            <dict>
               <key>policy_name</key>
               <string>%POLICY_NAME%</string>
               <key>policy_template</key>
               <string>%POLICY_TEMPLATE%</string>
               <key>replace_policy</key>
               <string>True</string>
            </dict>
         </dict>
         <dict>
            <key>Processor</key>
            <string>com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader</string>
            <key>Arguments</key>
            <dict>
               <key>computergroup_name</key>
               <string>%GROUP_NAME_OUTDATED_APP%</string>
               <key>computergroup_template</key>
               <string>%GROUP_TEMPLATE_OUTDATED_APP%</string>
               <key>replace_group</key>
               <string>True</string>
            </dict>
         </dict>
         <dict>
            <key>Processor</key>
            <string>com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader</string>
            <key>Arguments</key>
            <dict>
               <key>computergroup_name</key>
               <string>%GROUP_NAME_VPP_APP_REPLACEMENT_CACHED%</string>
               <key>computergroup_template</key>
               <string>%GROUP_TEMPLATE_VPP_APP_REPLACEMENT_CACHED%</string>
               <key>replace_group</key>
               <string>True</string>
            </dict>
         </dict>
         <dict>
            <key>Processor</key>
            <string>com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader</string>
            <key>Arguments</key>
            <dict>
               <key>computergroup_name</key>
               <string>%GROUP_NAME_VPP_APP_REPLACEMENT_NOT_CACHED%</string>
               <key>computergroup_template</key>
               <string>%GROUP_TEMPLATE_VPP_APP_REPLACEMENT_NOT_CACHED%</string>
               <key>replace_group</key>
               <string>True</string>
            </dict>
         </dict>
         <dict>
            <key>Processor</key>
            <string>com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader</string>
            <key>Arguments</key>
            <dict>
               <key>policy_name</key>
               <string>%POLICY_NAME_VPP_APP_REPLACEMENT_SELFSERVICE%</string>
               <key>policy_template</key>
               <string>%POLICY_TEMPLATE_VPP_APP_REPLACEMENT_SELFSERVICE%</string>
               <key>replace_policy</key>
               <string>True</string>
            </dict>
         </dict>
         <dict>
            <key>Processor</key>
            <string>com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader</string>
            <key>Arguments</key>
            <dict>
               <key>policy_name</key>
               <string>%POLICY_NAME_VPP_APP_REPLACEMENT_INSTALL%</string>
               <key>policy_template</key>
               <string>%POLICY_TEMPLATE_VPP_APP_REPLACEMENT_INSTALL%</string>
               <key>replace_policy</key>
               <string>True</string>
            </dict>
         </dict>
         <dict>
            <key>Processor</key>
            <string>com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader</string>
            <key>Arguments</key>
            <dict>
               <key>policy_name</key>
               <string>%POLICY_NAME_VPP_APP_REPLACEMENT_CACHE%</string>
               <key>policy_template</key>
               <string>%POLICY_TEMPLATE_VPP_APP_REPLACEMENT_CACHE%</string>
               <key>replace_policy</key>
               <string>True</string>
            </dict>
         </dict>
         <dict>
            <key>Processor</key>
            <string>com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader</string>
            <key>Arguments</key>
            <dict>
               <key>policy_name</key>
               <string>%POLICY_NAME_VPP_APP_REPLACEMENT_INSTALL_CACHED%</string>
               <key>policy_template</key>
               <string>%POLICY_TEMPLATE_VPP_APP_REPLACEMENT_INSTALL_CACHED%</string>
               <key>replace_policy</key>
               <string>True</string>
            </dict>
         </dict>
      </array>
   </dict>
</plist>