<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
   <dict>
      <key>Description</key>
      <string>Uses parent pkg recipe to download the latest Microsoft InTune Company Portal installer package and import it into the Jamf Pro server.</string>
      <key>Identifier</key>
      <string>corp.sap.maccoe.jamf.MicrosoftInTuneCompanyPortal-App-AutoUpdate-AllObjects</string>
      <key>Input</key>
      <dict>
         <key>NAME</key>
         <string>Microsoft Company Portal</string>
         <key>CATEGORY</key>
         <string>Apps</string>
         <key>PKG_CATEGORY</key>
         <string>%CATEGORY%</string>
         <key>PROD_NAME</key>
         <string>MicrosoftInTuneCompanyPortal</string>
         <key>POLICY_NAME</key>
         <string>macOS-i858772-202204&#58; Auto Update %PROD_NAME%</string>
         <key>POLICY_CATEGORY</key>
         <string>Apps-AutoUpdate</string>
         <key>POLICY_TEMPLATE</key>
         <string>PolicyTemplate-autoupdate.xml</string>
         <key>POLICY_TRIGGER</key>
         <string>autoupdate-%PROD_NAME%</string>
         <key>SLEEP_IN_SECONDS</key>
         <string>0</string>
         <key>STOPPROCESSINGIF_PREDICATE1</key>
         <string>download_changed == FALSE</string>
         <key>STOPPROCESSINGIF_PREDICATE2</key>
         <string>pkg_uploaded == FALSE</string>
         <key>APP_INVENTORY_PRIMARY_CRITERION_NAME</key>
         <string>Application Bundle ID</string>
         <key>APP_INVENTORY_PRIMARY_CRITERION_VALUE</key>
         <string>%APP_BUNDLE_ID%</string>
         <key>APP_BUNDLE_ID</key>
         <string>com.microsoft.CompanyPortalMac</string>
         <key>APP_BUNDLE_ID_REGEX</key>
         <string>com\.microsoft\.CompanyPortalMac</string>
         <key>GROUP_NAME_APP_OUTDATED</key>
         <string></string>
         <key>GROUP_TEMPLATE_APP_OUTDATED</key>
         <string>SmartGroupTemplate-app-outdated.xml</string>
         <key>GROUP_NAME_APP_CURRENT</key>
         <string></string>
         <key>GROUP_TEMPLATE_APP_CURRENT</key>
         <string>SmartGroupTemplate-app-current.xml</string>
      </dict>
      <key>MinimumVersion</key>
      <string>2.0.0</string>
      <key>ParentRecipe</key>
      <string>corp.sap.maccoe.pkg.MicrosoftInTuneCompanyPortal</string>
      <key>Process</key>
      <array>
         <dict>
            <key>Arguments</key>
            <dict>
               <key>predicate</key>
               <string>%STOPPROCESSINGIF_PREDICATE1%</string>
            </dict>
            <key>Processor</key>
            <string>StopProcessingIf</string>
         </dict>
         <dict>
            <key>Arguments</key>
            <dict>
               <key>category_name</key>
               <string>%CATEGORY%</string>
            </dict>
            <key>Processor</key>
            <string>com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader</string>
         </dict>
         <dict>
            <key>Arguments</key>
            <dict>
               <key>pkg_category</key>
               <string>%PKG_CATEGORY%</string>
               <key>pkg_notes</key>
               <string>%NAME% %version% installer uploaded via AutoPkg.</string>
            </dict>
            <key>Processor</key>
            <string>com.github.grahampugh.jamf-upload.processors/JamfPackageUploader</string>
         </dict>
         <dict>
            <key>Arguments</key>
            <dict>
               <key>predicate</key>
               <string>%STOPPROCESSINGIF_PREDICATE2%</string>
            </dict>
            <key>Processor</key>
            <string>StopProcessingIf</string>
         </dict>
         <dict>
            <key>Processor</key>
            <string>corp.sap.autopkg.SharedProcessors/Sleep</string>
            <key>Arguments</key>
            <dict>
               <key>sleep_seconds</key>
               <string>%SLEEP_IN_SECONDS%</string>
            </dict>
         </dict>
         <dict>
            <key>Arguments</key>
            <dict>
               <key>category_name</key>
               <string>%POLICY_CATEGORY%</string>
            </dict>
            <key>Processor</key>
            <string>com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader</string>
         </dict>
         <dict>
            <key>Processor</key>
            <string>com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader</string>
            <key>Arguments</key>
            <dict>
               <key>computergroup_name</key>
               <string>%GROUP_NAME_APP_OUTDATED%</string>
               <key>computergroup_template</key>
               <string>%GROUP_TEMPLATE_APP_OUTDATED%</string>
               <key>replace_group</key>
               <string>True</string>
               <key>APP_INVENTORY_VERSION</key>
               <string>%version%</string>
            </dict>
         </dict>
         <dict>
            <key>Processor</key>
            <string>com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader</string>
            <key>Arguments</key>
            <dict>
               <key>computergroup_name</key>
               <string>%GROUP_NAME_APP_CURRENT%</string>
               <key>computergroup_template</key>
               <string>%GROUP_TEMPLATE_APP_CURRENT%</string>
               <key>replace_group</key>
               <string>True</string>
               <key>APP_INVENTORY_VERSION</key>
               <string>%version%</string>
            </dict>
         </dict>
         <dict>
            <key>Processor</key>
            <string>com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader</string>
            <key>Arguments</key>
            <dict>
               <key>policy_name</key>
               <string>%POLICY_NAME%</string>
               <key>policy_template</key>
               <string>%POLICY_TEMPLATE%</string>
               <key>replace_policy</key>
               <string>True</string>
            </dict>
         </dict>
      </array>
   </dict>
</plist>