<?xml version="1.0" encoding="UTF-8"?>
<policy>
  <general>
    <name>%POLICY_NAME_VPP_APP_REPLACEMENT_INSTALL%</name>
    <enabled>true</enabled>
    <trigger>USER_INITIATED</trigger>
    <trigger_checkin>false</trigger_checkin>
    <trigger_enrollment_complete>false</trigger_enrollment_complete>
    <trigger_login>false</trigger_login>
    <trigger_network_state_changed>false</trigger_network_state_changed>
    <trigger_startup>false</trigger_startup>
    <trigger_other/>
    <frequency>Ongoing</frequency>
    <category>
      <name>%CATEGORY%</name>
    </category>
    <date_time_limitations/>
    <network_limitations/>
    <override_default_settings/>
    <network_requirements/>
    <site/>
  </general>
  <scope>
    <all_computers>true</all_computers>
    <computers/>
    <computer_groups/>
    <exclusions>
      <computers/>
      <computer_groups>
        <computer_group>
          <name>%GROUP_NAME_INSTALLED_APP%</name>
        </computer_group>
        <computer_group>
          <name>%GROUP_NAME_NONCOMPLIANT%</name>
        </computer_group>
        <computer_group>
          <name>%GROUP_NAME_VPP_APP_REPLACEMENT%</name>
        </computer_group>
      </computer_groups>
    </exclusions>
  </scope>
  <self_service>
    <use_for_self_service>true</use_for_self_service>
    <self_service_display_name>%POLICY_DISPLAY_NAME_VPP_APP_REPLACEMENT_INSTALL%</self_service_display_name>
    <install_button_text>Install</install_button_text>
    <reinstall_button_text>Install</reinstall_button_text>
    <self_service_description>%POLICY_DESCRIPTION_VPP_APP_REPLACEMENT_INSTALL%</self_service_description>
    <force_users_to_view_description>false</force_users_to_view_description>
    <feature_on_main_page>false</feature_on_main_page>
    <self_service_categories>
      <category>
        <name>%CATEGORY%</name>
        <display_in>true</display_in>
        <feature_in>false</feature_in>
      </category>
    </self_service_categories>
    <notification>false</notification>
    <notification_type/>
    <notification_subject/>
    <notification_message/>
  </self_service>
  <package_configuration>
    <packages>
      <size>1</size>
      <package>
        <name>%pkg_name%</name>
        <action>Install</action>
        <fut/>
        <feu/>
      </package>
    </packages>
    <distribution_point/>
  </package_configuration>
  <scripts/>
  <printers/>
  <dock_items/>
  <account_maintenance/>
  <reboot/>
  <maintenance>
    <recon>true</recon>
  </maintenance>
  <files_processes/>
  <user_interaction/>
  <disk_encryption/>
</policy>
