<?xml version="1.0" encoding="UTF-8"?>
<policy>
  <general>
    <name>%POLICY_NAME_VPP_APP_REPLACEMENT_SELFSERVICE%</name>
    <enabled>true</enabled>
    <trigger>USER_INITIATED</trigger>
    <frequency>Ongoing</frequency>
    <category>
      <name>Apps</name>
    </category>
    <date_time_limitations/>
    <network_limitations/>
    <override_default_settings/>
    <network_requirements/>
    <site/>
  </general>
  <scope>
    <all_computers>false</all_computers>
    <computers/>
    <computer_groups>
      <computer_group>
        <name>%GROUP_NAME_VPP_APP_REPLACEMENT%</name>
      </computer_group>
    </computer_groups>
    <exclusions>
      <computers/>
      <computer_groups>
        <computer_group>
          <name>%GROUP_NAME_NONCOMPLIANT%</name>
        </computer_group>
        <computer_group>
          <name>%GROUP_NAME_VPP_APP_REPLACEMENT_INSTALL_NOT_CACHED%</name>
        </computer_group>
      </computer_groups>
    </exclusions>
  </scope>
  <self_service>
    <use_for_self_service>true</use_for_self_service>
    <self_service_display_name>%POLICY_DISPLAY_NAME_VPP_APP_REPLACEMENT_SELFSERVICE%</self_service_display_name>
    <install_button_text>Replace</install_button_text>
    <reinstall_button_text>Replace</reinstall_button_text>
    <self_service_description>%POLICY_DESCRIPTION_VPP_APP_REPLACEMENT_SELFSERVICE%</self_service_description>
    <force_users_to_view_description>true</force_users_to_view_description>
    <feature_on_main_page>true</feature_on_main_page>
    <self_service_categories>
      <category>
        <name>%CATEGORY%</name>
        <display_in>true</display_in>
        <feature_in>false</feature_in>
      </category>
    </self_service_categories>
    <notification>false</notification>
    <notification_type>Self Service</notification_type>
    <notification_subject/>
    <notification_message/>
  </self_service>
  <package_configuration>
    <packages>
      <size/>0</size>
    </packages>
  </package_configuration>
  <scripts>
    <size>0</size>
  </scripts>
  <maintenance/>
  <files_processes>
    <run_command>/usr/local/bin/jamf policy -event "%TRIGGER_VPP_APP_REPLACEMENT_SELFSERVICE%"</run_command>
  </files_processes>
</policy>
