<?xml version="1.0" encoding="UTF-8"?>
<policy>
   <general>
      <name>%SAPGUI_POLICY_NAME%</name>
      <enabled>true</enabled>
      <frequency>Ongoing</frequency>
      <category>
         <name>%SAPGUI_POLICY_CATEGORY%</name>
      </category>
   </general>
   <scope>
      <computer_groups>
         <computer_group>
            <name>%GROUP_NAME1%</name>
         </computer_group>
      </computer_groups>
      <exclusions>
         <computers />
         <computer_groups>
            <computer_group>
               <name>%GROUP_NAME3%</name>
            </computer_group>
            <computer_group>
               <name>%GROUP_NAME2%</name>
            </computer_group>
         </computer_groups>
      </exclusions>
   </scope>
   <package_configuration>
      <size>0</size>
   </package_configuration>
   <scripts>
      <size>0</size>
   </scripts>
   <self_service>
      <use_for_self_service>true</use_for_self_service>
      <install_button_text>%INSTALL_BUTTON_TEXT%</install_button_text>
      <reinstall_button_text>%REINSTALL_BUTTON_TEXT%</reinstall_button_text>
      <self_service_display_name>%SELF_SERVICE_DISPLAY_NAME%</self_service_display_name>
      <self_service_description>%SELF_SERVICE_DESCRIPTION%</self_service_description>
   </self_service>
   <maintenance>
      <recon>false</recon>
   </maintenance>
   <files_processes>
      <run_command>%SAPGUI_POLICY_RUN_COMMAND%</run_command>
   </files_processes>
</policy>