<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
   <dict>
      <key>Description</key>
      <string>Uses parent pkg recipe to download SAP GUI and import it into the Jamf Pro server.</string>
      <key>Identifier</key>
      <string>corp.sap.maccoe.jamf.sapgui</string>
      <key>Input</key>
      <dict>
         <key>NAME</key>
         <string>SAP GUI</string>
         <key>CATEGORY</key>
         <string>Apps</string>
         <key>PKG_CATEGORY</key>
         <string>%CATEGORY%</string>
         <key>GROUP_TEMPLATE</key>
         <string>SAPGUISmartGroupTemplate.xml</string>
         <key>GROUP_NAME</key>
         <string>macOS-i858772-202107&#58; %NAME% installed and not latest version</string>
         <key>GROUP_TEMPLATE2</key>
         <string>SAPGUISmartGroupTemplate2.xml</string>
         <key>GROUP_NAME2</key>
         <string>macOS-i858772-202107&#58; %NAME% installed and latest version</string>
         <key>API_APP_IDENTIFIER</key>
         <string>Application Bundle ID</string>
         <key>STOPPROCESSINGIF_PREDICATE</key>
         <string>pkg_uploaded == FALSE</string>
      </dict>
      <key>MinimumVersion</key>
      <string>2.0.0</string>
      <key>ParentRecipe</key>
      <string>corp.sap.maccoe.sign.sapgui</string>
      <key>Process</key>
      <array>
         <dict>
            <key>Arguments</key>
            <dict>
               <key>category_name</key>
               <string>%CATEGORY%</string>
            </dict>
            <key>Processor</key>
            <string>com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader</string>
         </dict>
         <dict>
            <key>Arguments</key>
            <dict>
               <key>pkg_category</key>
               <string>%PKG_CATEGORY%</string>
               <key>pkg_notes</key>
               <string>%NAME% %version% installer uploaded via AutoPkg.</string>
            </dict>
            <key>Processor</key>
            <string>com.github.grahampugh.jamf-upload.processors/JamfPackageUploader</string>
         </dict>
         <dict>
            <key>Arguments</key>
            <dict>
               <key>predicate</key>
               <string>%STOPPROCESSINGIF_PREDICATE%</string>
            </dict>
            <key>Processor</key>
            <string>StopProcessingIf</string>
         </dict>
         <dict>
            <key>Arguments</key>
            <dict>
               <key>computergroup_name</key>
               <string>%GROUP_NAME%</string>
               <key>computergroup_template</key>
               <string>%GROUP_TEMPLATE%</string>
               <key>replace_group</key>
               <string>True</string>
            </dict>
            <key>Processor</key>
            <string>com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader</string>
         </dict>
         <dict>
            <key>Arguments</key>
            <dict>
               <key>computergroup_name</key>
               <string>%GROUP_NAME2%</string>
               <key>computergroup_template</key>
               <string>%GROUP_TEMPLATE2%</string>
               <key>replace_group</key>
               <string>True</string>
            </dict>
            <key>Processor</key>
            <string>com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader</string>
         </dict>
      </array>
   </dict>
</plist>