<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
   <dict>
      <key>Description</key>
      <string>Uses parent pkg recipe to download SAP GUI and import it into the Jamf Pro server.</string>
      <key>Identifier</key>
      <string>corp.sap.maccoe.jamf.SAPGUI-App-SmartGroupUpdate</string>
      <key>Input</key>
      <dict>
         <key>NAME</key>
         <string>SAP GUI</string>
         <key>PROD_NAME</key>
         <string>SAPGUI</string>
         <key>GROUP_TEMPLATE1</key>
         <string>SAPGUISmartGroupTemplate.xml</string>
         <key>GROUP_NAME1</key>
         <string>macOS-i858772-202107&#58; %NAME% installed and not latest version</string>
         <key>GROUP_TEMPLATE2</key>
         <string>SAPGUISmartGroupTemplate2.xml</string>
         <key>GROUP_NAME2</key>
         <string>macOS-i858772-202107&#58; %NAME% installed and latest version</string>
         <key>API_APP_IDENTIFIER</key>
         <string>Application Bundle ID</string>
         <key>SLEEP_IN_SECONDS</key>
         <string>0</string>
         <key>STOPPROCESSINGIF_PREDICATE1</key>
         <string>download_changed == FALSE</string>
         <key>STOPPROCESSINGIF_PREDICATE2</key>
         <string>pkg_uploaded == FALSE</string>
      </dict>
      <key>MinimumVersion</key>
      <string>2.0.0</string>
      <key>ParentRecipe</key>
      <string>corp.sap.maccoe.jamf.SAPGUI-App-AutoUpdate</string>
      <key>Process</key>
      <array>
         <dict>
            <key>Arguments</key>
            <dict>
               <key>predicate</key>
               <string>%STOPPROCESSINGIF_PREDICATE1%</string>
            </dict>
            <key>Processor</key>
            <string>StopProcessingIf</string>
         </dict>
         <dict>
            <key>Arguments</key>
            <dict>
               <key>predicate</key>
               <string>%STOPPROCESSINGIF_PREDICATE2%</string>
            </dict>
            <key>Processor</key>
            <string>StopProcessingIf</string>
         </dict>
         <dict>
            <key>Processor</key>
            <string>corp.sap.autopkg.SharedProcessors/Sleep</string>
            <key>Arguments</key>
            <dict>
               <key>sleep_seconds</key>
               <string>%SLEEP_IN_SECONDS%</string>
            </dict>
         </dict>
         <dict>
            <key>Arguments</key>
            <dict>
               <key>computergroup_name</key>
               <string>%GROUP_NAME1%</string>
               <key>computergroup_template</key>
               <string>%GROUP_TEMPLATE1%</string>
               <key>replace_group</key>
               <string>True</string>
            </dict>
            <key>Processor</key>
            <string>com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader</string>
         </dict>
         <dict>
            <key>Processor</key>
            <string>corp.sap.autopkg.SharedProcessors/Sleep</string>
            <key>Arguments</key>
            <dict>
               <key>sleep_seconds</key>
               <string>%SLEEP_IN_SECONDS%</string>
            </dict>
         </dict>
         <dict>
            <key>Arguments</key>
            <dict>
               <key>computergroup_name</key>
               <string>%GROUP_NAME2%</string>
               <key>computergroup_template</key>
               <string>%GROUP_TEMPLATE2%</string>
               <key>replace_group</key>
               <string>True</string>
            </dict>
            <key>Processor</key>
            <string>com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader</string>
         </dict>
      </array>
   </dict>
</plist>