<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
   <dict>
      <key>Description</key>
      <string>Downloads the current release version of the F5 Networks BIG-IP Edge Client, builds an installer package and signs it.</string>
      <key>Identifier</key>
      <string>corp.sap.maccoe.sign.configuration.f5vpn</string>
      <key>Input</key>
      <dict>
		<key>NAME</key>
		<string>F5 Networks BIG-IP Edge Client</string>
		<key>PACKAGER</key>
		<string>SAPCorp</string>
		<key>SOFTWARETITLE1</key>
		<string>BIG-IP</string>
		<key>SOFTWARETITLE2</key>
		<string>Edge</string>
		<key>SOFTWARETITLE3</key>
		<string>Client</string>
         <key>SOFTWARETITLE4</key>
         <string>Configuration</string>
		<key>VENDOR</key>
		<string>F5Networks</string>
         <key>SIGNINGCERTIFICATE</key>
         <string>Put_Signing_Certificate_into_AutoPkg_recipe_override</string>
      </dict>
      <key>ParentRecipe</key>
      <string>corp.sap.maccoe.pkg.configuration.f5vpn</string>
      <key>Process</key>
      <array>
         <dict>
            <key>Processor</key>
            <string>corp.sap.autopkg.SharedProcessors/PkgSigner</string>
            <key>Arguments</key>
            <dict>
               <key>pkg_path</key>
               <string>%RECIPE_CACHE_DIR%/%PACKAGER%_%VENDOR%_%SOFTWARETITLE1%_%SOFTWARETITLE2%_%SOFTWARETITLE3%_%SOFTWARETITLE4%_%version%.pkg</string>
               <key>signing_cert</key>
               <string>%SIGNINGCERTIFICATE%</string>
            </dict>
         </dict>
      </array>
   </dict>
</plist>
