<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
   <dict>
      <key>Description</key>
      <string>Downloads the current release version of Code42 for Intel and Apple Silicon, builds an installer package and signs it.</string>
      <key>Identifier</key>
      <string>corp.sap.maccoe.sign.Code42Universal</string>
      <key>Input</key>
      <dict>
         <key>NAME</key>
         <string>Code42</string>
         <key>PACKAGER</key>
         <string>SAPCorp</string>
         <key>VENDOR</key>
         <string>Code42</string>
         <key>SIGNINGCERTIFICATE</key>
         <string>Put_Signing_Certificate_into_AutoPkg_recipe_override</string>
      </dict>
      <key>ParentRecipe</key>
      <string>corp.sap.maccoe.pkg.Code42Universal</string>
      <key>Process</key>
      <array>
         <dict>
            <key>Processor</key>
            <string>corp.sap.autopkg.SharedProcessors/PkgSigner</string>
            <key>Arguments</key>
            <dict>
               <key>pkg_path</key>
               <string>%RECIPE_CACHE_DIR%/%PACKAGER%_%VENDOR%_Universal_%version%.pkg</string>
               <key>signing_cert</key>
               <string>%SIGNINGCERTIFICATE%</string>
            </dict>
         </dict>
      </array>
   </dict>
</plist>
