<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
   <dict>
      <key>Description</key>
      <string>Downloads the latest version of Feedback Catcher and creates an installer package.</string>
      <key>Identifier</key>
      <string>corp.sap.maccoe.pkg.feedbackcatcher</string>
      <key>Input</key>
      <dict>
         <key>NAME</key>
         <string>Feedback Catcher</string>
         <key>PACKAGER</key>
         <string>SAPCorp</string>
         <key>VENDOR</key>
         <string>SAP</string>
         <key>SOFTWARETITLE1</key>
         <string>Feedback</string>   
         <key>SOFTWARETITLE2</key>
         <string>Catcher</string> 
      </dict>
      <key>MinimumVersion</key>
      <string>1.0.0</string>
      <key>ParentRecipe</key>
      <string>corp.sap.maccoe.download.feedbackcatcher</string>
      <key>Process</key>
      <array>
         <dict>
            <key>Processor</key>
            <string>PkgRootCreator</string>
            <key>Arguments</key>
            <dict>
               <key>pkgroot</key>
               <string>%RECIPE_CACHE_DIR%/%SOFTWARETITLE1%%SOFTWARETITLE2%</string>
               <key>pkgdirs</key>
               <dict>
                  <key>Applications</key>
                  <string>0755</string>
               </dict>
            </dict>
         </dict>
         <dict>
            <key>Processor</key>
            <string>Copier</string>
            <key>Arguments</key>
            <dict>
               <key>source_path</key>
               <string>%RECIPE_CACHE_DIR%/%VENDOR%/%SOFTWARETITLE1% %SOFTWARETITLE2%.app</string>
               <key>destination_path</key>
               <string>%pkgroot%/Applications/%SOFTWARETITLE1% %SOFTWARETITLE2%.app</string>
            </dict>
         </dict>
         <dict>
            <key>Processor</key>
            <string>Versioner</string>
            <key>Arguments</key>
            <dict>
               <key>input_plist_path</key>
               <string>%pkgroot%/Applications/%SOFTWARETITLE1% %SOFTWARETITLE2%.app/Contents/Info.plist</string>
               <key>plist_version_key</key>
               <string>CFBundleVersion</string>
            </dict>
         </dict>
         <dict>
            <key>Processor</key>
            <string>PkgCreator</string>
            <key>Arguments</key>
            <dict>
               <key>pkgname</key>
               <string>%PACKAGER%_%SOFTWARETITLE1%_%SOFTWARETITLE2%_%version%</string>
               <key>pkg_request</key>
               <dict>
                  <key>version</key>
                  <string>%version%</string>
                  <key>id</key>
                  <string>corp.sap.feedbackcatcher.pkg</string>
                  <key>options</key>
                  <string>purge_ds_store</string>
                  <key>chown</key>
                  <array>
                     <dict>
                        <key>path</key>
                        <string>Applications</string>
                        <key>user</key>
                        <string>root</string>
                        <key>group</key>
                        <string>wheel</string>
                     </dict>
                  </array>
               </dict>
            </dict>
         </dict>
         <dict>
            <key>Arguments</key>
            <dict>
               <key>path_list</key>
               <array>
                  <string>%RECIPE_CACHE_DIR%/%SOFTWARETITLE1%%SOFTWARETITLE2%</string>
                  <string>%RECIPE_CACHE_DIR%/%VENDOR%</string>
               </array>
            </dict>
            <key>Processor</key>
            <string>PathDeleter</string>
         </dict>
      </array>
   </dict>
</plist>