<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
   <dict>
      <key>Description</key>
      <string>Downloads the latest NexThink Collector installer package and prepares it for deployment.</string>
      <key>Identifier</key>
      <string>corp.sap.maccoe.pkg.NexThinkCollector</string>
      <key>Input</key>
      <dict>
         <key>NAME</key>
         <string>NexThink Collector</string>
         <key>VENDOR</key>
         <string>NexThink</string>
         <key>SOFTWARETITLE</key>
         <string>Collector</string>
         <key>PACKAGER</key>
         <string>SAPCorp</string>
         <key>NTTCPPORT</key>
         <string>443</string>
         <key>NTUDPPORT</key>
         <string>999</string>
         <key>NTREMOTEACTIONS</key>
         <string>disabled</string>
         <key>NTENGAGE</key>
         <string>disable</string>
         <key>NTASSIGNMENT</key>
         <string>enable</string>
         <key>NTSERVERADDRESS</key>
         <string>Put_nextthink_server_address_into_AutoPkg_recipe_override</string>
         <key>NTSTRINGTAG</key>
         <string>Put_nextthink_string_tag_into_AutoPkg_recipe_override</string>
         <key>NTCUSTOMERKEYNAME</key>
         <string>sap-cloud-nexthink-customer-key.txt</string>
         <key>NTCUSTOMERKEYDATA</key>
         <string>Put_nextthink_customer_key_data_into_AutoPkg_recipe_override</string>
      </dict>
      <key>MinimumVersion</key>
      <string>1.0.0</string>
      <key>ParentRecipe</key>
      <string>corp.sap.maccoe.download.NexThinkCollector</string>
      <key>Process</key>
      <array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>predicate</key>
				<string>NTSERVERADDRESS == "Put_nextthink_server_address_into_AutoPkg_recipe_override"</string>
			</dict>
			<key>Processor</key>
			<string>StopProcessingIf</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>predicate</key>
				<string>NTSTRINGTAG == "Put_nextthink_string_tag_into_AutoPkg_recipe_override"</string>
			</dict>
			<key>Processor</key>
			<string>StopProcessingIf</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>predicate</key>
				<string>NTCUSTOMERKEYDATA == "Put_nextthink_customer_key_data_into_AutoPkg_recipe_override"</string>
			</dict>
			<key>Processor</key>
			<string>StopProcessingIf</string>
		</dict>
         <dict>
            <key>Comment</key>
            <string>Get version from the installer application</string>
            <key>Processor</key>
            <string>Versioner</string>
            <key>Arguments</key>
            <dict>
               <key>input_plist_path</key>
               <string>%RECIPE_CACHE_DIR%/downloads/%VENDOR%%SOFTWARETITLE%.dmg/csi.app/Contents/Info.plist</string>
               <key>plist_version_key</key>
               <string>CFBundleVersion</string>
            </dict>
         </dict>
         <dict>
            <key>Processor</key>
            <string>PkgRootCreator</string>
            <key>Arguments</key>
            <dict>
               <key>pkgroot</key>
               <string>%RECIPE_CACHE_DIR%/Scripts</string>
               <key>pkgdirs</key>
               <dict />
            </dict>
         </dict>
         <dict>
            <key>Processor</key>
            <string>PkgRootCreator</string>
            <key>Arguments</key>
            <dict>
               <key>pkgroot</key>
               <string>%RECIPE_CACHE_DIR%/Scripts/CustomerKeys</string>
               <key>pkgdirs</key>
               <dict />
            </dict>
         </dict>
         <dict>
            <key>Processor</key>
            <string>PkgRootCreator</string>
            <key>Arguments</key>
            <dict>
               <key>pkgroot</key>
               <string>%RECIPE_CACHE_DIR%/pkgroot</string>
               <key>pkgdirs</key>
               <dict />
            </dict>
         </dict>
         <dict>
            <key>Processor</key>
            <string>Copier</string>
            <key>Arguments</key>
            <dict>
               <key>source_path</key>
               <string>%RECIPE_CACHE_DIR%/downloads/%VENDOR%%SOFTWARETITLE%.dmg</string>
               <key>destination_path</key>
               <string>%RECIPE_CACHE_DIR%/Scripts/%VENDOR%%SOFTWARETITLE%.dmg</string>
               <key>purge_destination</key>
               <true />
            </dict>
         </dict>
         <dict>
            <key>Processor</key>
            <string>FileCreator</string>
            <key>Arguments</key>
            <dict>
               <key>file_path</key>
               <string>%RECIPE_CACHE_DIR%/Scripts/CustomerKeys/%NTCUSTOMERKEYNAME%</string>
               <key>file_mode</key>
               <string>0755</string>
               <key>file_content</key>
               <string>%NTCUSTOMERKEYDATA%</string>
            </dict>
         </dict>
         <dict>
            <key>Processor</key>
            <string>FileCreator</string>
            <key>Arguments</key>
            <dict>
               <key>file_path</key>
               <string>%RECIPE_CACHE_DIR%/Scripts/postinstall</string>
               <key>file_mode</key>
               <string>0755</string>
               <key>file_content</key>
               <string>#!/bin/bash

# postinstall.sh, 0.7
# (c) 2023, SAP SE (Rich Trouton &lt;rich.trouton@sap.com&gt;)

# latest change:
# 2023/03/15, Rich Trouton &lt;rich.trouton@sap.com&gt;

# Description: Script to install the NexThink Collector from the pre-cached dmg installer file with Customer Key.

ERROR=0

# File Paths

if [[ -f "$(/usr/bin/find $(dirname $0) -maxdepth 1 \( -iname \*\.dmg \))" ]]; then
   dmgFile="$(/usr/bin/find $(dirname $0) -maxdepth 1 \( -iname \*\.dmg \))"
fi

dmgMount="$(/usr/bin/mktemp -d /tmp/Nexthink_Collector.XXXX)"
csiAppPath="$dmgMount/csi.app/Contents/MacOS/"

# Remove the trailing slash from the csiAppPath variable if needed.
csiAppPath=${csiAppPath%%/}

#installer variables
address="%NTSERVERADDRESS%"
remoteactions_setting="%NTREMOTEACTIONS%"
engage_setting="%NTENGAGE%"
assignment_setting="%NTASSIGNMENT%"
stringtag="%NTSTRINGTAG%"
tcpport="%NTTCPPORT%"
udpport="%NTUDPPORT%"
customerKey="$(dirname $0)/CustomerKeys/*.txt"

# Mount the DMG
/usr/bin/hdiutil attach "$dmgFile" -mountpoint "$dmgMount" -nobrowse -noverify -noautoopen

# Install the NexThink Collector software

# Define the parameters for csi.app for installing the Collector from the command line interface
"$csiAppPath"/csi -address ${address} -port ${udpport} -tcp_port ${tcpport} -key ${customerKey} -engage ${engage_setting} -data_over_tcp enable -use_assignment ${assignment_setting} -ra_execution_policy ${remoteactions_setting} -string_tag "$stringtag"

# Disable/Enable Coordinator Service
launchctl bootout system /Library/LaunchDaemons/com.nexthink.collector.nxtcoordinator.plist
launchctl bootstrap system /Library/LaunchDaemons/com.nexthink.collector.nxtcoordinator.plist

# Unmount the DMG
hdiutil detach $dmgMount -force

exit $ERROR</string>
            </dict>
         </dict>
         <dict>
            <key>Processor</key>
            <string>PkgCreator</string>
            <key>Arguments</key>
            <dict>
               <key>pkg_request</key>
               <dict>
                  <key>pkgroot</key>
                  <string>%RECIPE_CACHE_DIR%/pkgroot</string>
                  <key>pkgname</key>
                  <string>%PACKAGER%_%VENDOR%_%SOFTWARETITLE%_%version%</string>
                  <key>pkgtype</key>
                  <string>flat</string>
                  <key>id</key>
                  <string>corp.sap.nexthink.nexthinkcollector</string>
                  <key>version</key>
                  <string>%version%</string>
                  <key>scripts</key>
                  <string>Scripts</string>
               </dict>
            </dict>
         </dict>
         <dict>
            <key>Arguments</key>
            <dict>
               <key>path_list</key>
               <array>
                  <string>%RECIPE_CACHE_DIR%/Scripts</string>
               </array>
            </dict>
            <key>Processor</key>
            <string>PathDeleter</string>
         </dict>
      </array>
   </dict>
</plist>