<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of SAP GUI for macOS and packages it for installation.</string>
	<key>Identifier</key>
	<string>corp.sap.maccoe.pkg.sapguiuniversal</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>SAP GUI</string>
         <key>PACKAGER</key>
         <string>SAPCorp</string>
        <key>VENDOR</key>
        <string>SAP</string>
        <key>SOFTWARETITLE1</key>
        <string>SAPGUI</string>
        <key>SOFTWARETITLE2</key>
        <string>Universal</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>corp.sap.maccoe.download.sapguiuniversal</string>
	<key>Process</key>
	<array>
         <dict>
            <key>Processor</key>
            <string>PlistReader</string>
            <key>Arguments</key>
            <dict>
               <key>info_path</key>
               <string>%RECIPE_CACHE_DIR%/%VENDOR%/com.sapgui.identifier.plist</string>
               <key>plist_keys</key>
               <dict>
               	<key>CFBundleShortVersionString</key>
               	<string>version</string>
               	<key>AlphanumericVersionString</key>
               	<string>alphanumeric_version</string>
               	<key>CFBundleIdentifier</key>
               	<string>bundle_identifier</string>
               </dict>
            </dict>
         </dict>
         <dict>
            <key>Arguments</key>
            <dict>
               <key>predicate</key>
               <string>version == ""</string>
            </dict>
            <key>Processor</key>
            <string>StopProcessingIf</string>
         </dict>
         <dict>
            <key>Arguments</key>
            <dict>
               <key>predicate</key>
               <string>alphanumeric_version == ""</string>
            </dict>
            <key>Processor</key>
            <string>StopProcessingIf</string>
         </dict>
         <dict>
            <key>Arguments</key>
            <dict>
               <key>predicate</key>
               <string>bundle_identifier == ""</string>
            </dict>
            <key>Processor</key>
            <string>StopProcessingIf</string>
         </dict>
		<dict>
			<key>Processor</key>
			<string>PkgRootCreator</string>
			<key>Arguments</key>
			<dict>
				<key>pkgroot</key>
				<string>%RECIPE_CACHE_DIR%/Scripts</string>
				<key>pkgdirs</key>
				<dict/>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>PkgRootCreator</string>
			<key>Arguments</key>
			<dict>
				<key>pkgroot</key>
				<string>%RECIPE_CACHE_DIR%/Scripts/Intel</string>
				<key>pkgdirs</key>
				<dict/>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>PkgRootCreator</string>
			<key>Arguments</key>
			<dict>
				<key>pkgroot</key>
				<string>%RECIPE_CACHE_DIR%/Scripts/AppleSilicon</string>
				<key>pkgdirs</key>
				<dict/>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>PkgRootCreator</string>
			<key>Arguments</key>
			<dict>
				<key>pkgroot</key>
				<string>%RECIPE_CACHE_DIR%/pkgroot</string>
				<key>pkgdirs</key>
				<dict/>
			</dict>
		</dict>
         <dict>
            <key>Arguments</key>
            <dict>
               <key>pattern</key>
               <string>%RECIPE_CACHE_DIR%/%VENDOR%/*-intel64-*.dmg</string>
            </dict>
            <key>Processor</key>
            <string>FileFinder</string>
         </dict>
		<dict>
			<key>Processor</key>
			<string>Copier</string>
			<key>Arguments</key>
			<dict>
				<key>source_path</key>
				<string>%found_filename%/SAP GUI for Java Installer.app</string>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/Scripts/Intel/SAP GUI for Java Installer.app</string>
				<key>overwrite</key>
				<true/>
			</dict>
		</dict>
         <dict>
            <key>Arguments</key>
            <dict>
               <key>pattern</key>
               <string>%RECIPE_CACHE_DIR%/%VENDOR%/*-arm64-*.dmg</string>
            </dict>
            <key>Processor</key>
            <string>FileFinder</string>
         </dict>
		<dict>
			<key>Processor</key>
			<string>Copier</string>
			<key>Arguments</key>
			<dict>
				<key>source_path</key>
				<string>%found_filename%/SAP GUI for Java Installer.app</string>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/Scripts/AppleSilicon/SAP GUI for Java Installer.app</string>
				<key>overwrite</key>
				<true/>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>Copier</string>
			<key>Arguments</key>
			<dict>
				<key>source_path</key>
				<string>%RECIPE_CACHE_DIR%/%VENDOR%/templates.jar</string>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/Scripts/templates.jar</string>
				<key>overwrite</key>
				<true/>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>FileCreator</string>
			<key>Arguments</key>
			<dict>
				<key>file_path</key>
				<string>%RECIPE_CACHE_DIR%/Scripts/postinstall</string>
				<key>file_mode</key>
				<string>0755</string>
				<key>file_content</key>
				<string>#!/bin/bash

# postinstall.sh, 0.3
# (c) 2022, SAP SE (Marc Thielemann &lt;marc.thielemann@sap.com&gt;)

# latest change:
# 2022/09/15, Rich Trouton &lt;rich.trouton@sap.com&gt;

install_dir=$(/usr/bin/dirname $0)

# Determine if this Mac has an Intel or Apple Silicon processor

processor=$(/usr/sbin/sysctl -n machdep.cpu.brand_string | grep -o "Intel")

# If an Intel processor is detected, set the sap_gui_installer
# variable to the Intel version of SAP GUI.
# Otherwise, set the sap_gui_installer variable to the 
# Apple Silicon version of SAP GUI.

if [[ -n "$processor" ]]; then

sap_gui_installer="$install_dir/Intel/SAP GUI for Java Installer.app"

else

sap_gui_installer="$install_dir/AppleSilicon/SAP GUI for Java Installer.app"

fi

sap_gui_template="$install_dir/templates.jar"
sap_gui_install_path="/Applications/SAP Clients"

ERROR=0
IFS=$'\n'


function log {
	echo "$1"
	/usr/bin/logger "SAPCorp: $1"
}

if [[ -x "$sap_gui_installer" &#038;&#038; -f "$sap_gui_template" ]]; then

		  log "Attempting to install $sap_gui_install..."
		  "$sap_gui_installer/Contents/MacOS/install" -G --installdir "${sap_gui_install_path}" -J "${install_dir}" --force
	
		if [[ $? -ne 0 ]]; then
			log "ERROR! Installation of $sap_gui_installer failed"
			ERROR=1
			break
		else
			log "Successfully installed $sap_gui_installer"
		fi
fi

exit $ERROR</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>PkgCreator</string>
			<key>Arguments</key>
			<dict>
				<key>pkg_request</key>
				<dict>
					<key>pkgroot</key>
					<string>%RECIPE_CACHE_DIR%/pkgroot</string>
					<key>pkgname</key>
					<string>%PACKAGER%_%VENDOR%_%SOFTWARETITLE1%_%SOFTWARETITLE2%_%alphanumeric_version%</string>
					<key>pkgtype</key>
					<string>flat</string>
					<key>id</key>
					<string>corp.sap.sapgui</string>
					<key>version</key>
					<string>%alphanumeric_version%</string>
					<key>scripts</key>
					<string>Scripts</string>
				</dict>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>PathDeleter</string>
			<key>Arguments</key>
			<dict>
				<key>path_list</key>
				<array>
					<string>%RECIPE_CACHE_DIR%/%VENDOR%</string>
					<string>%RECIPE_CACHE_DIR%/Scripts</string>
				</array>
			</dict>
		</dict>
	</array>
</dict>
</plist>