<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Signs a provided installer package using a signing certificate identifier.</string>
	<key>Identifier</key>
	<string>corp.sap.maccoe.sign.Viscosity</string>
	<key>Input</key>
	<dict>
		<key>SIGNINGCERTIFICATE</key>
		<string>Put_Signing_Certificate_into_AutoPkg_recipe_override</string>
	</dict>
	<key>MinimumVersion</key>
	<string>2.3</string>
	<key>ParentRecipe</key>
	<string>corp.sap.maccoe.pkg.Viscosity</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%RECIPE_CACHE_DIR%/%PACKAGER%_%VENDOR%_%SOFTWARETITLE%_%version%.pkg</string>
				<key>signing_cert</key>
				<string>%SIGNINGCERTIFICATE%</string>
			</dict>
			<key>Processor</key>
			<string>corp.sap.autopkg.SharedProcessors/PkgSigner</string>
		</dict>
	</array>
</dict>
</plist>
