<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
   <dict>
      <key>Description</key>
      <string>Downloads the current release version of the McAfee Endpoint Security installer package and renames the installer package to match our naming standard.</string>
      <key>Identifier</key>
      <string>corp.sap.maccoe.pkg.mcafeeendpointsecurity</string>
      <key>Input</key>
      <dict>
         <key>NAME</key>
         <string>McAfee Endpoint Security</string>
         <key>VENDOR</key>
         <string>McAfee</string>
         <key>SOFTWARETITLE</key>
         <string>EndpointSecurity</string>
      </dict>
      <key>MinimumVersion</key>
      <string>1.0.0</string>
      <key>ParentRecipe</key>
      <string>corp.sap.maccoe.download.mcafeeendpointsecurity</string>
      <key>Process</key>
      <array>
         <dict>
            <key>Processor</key>
            <string>Versioner</string>
            <key>Arguments</key>
            <dict>
               <key>input_plist_path</key>
               <string>%RECIPE_CACHE_DIR%/%VENDOR%/com.mcafeeendpointsecurity.identifier.plist</string>
               <key>plist_version_key</key>
               <string>CFBundleShortVersionString</string>
            </dict>
         </dict>
         <dict>
            <key>Arguments</key>
            <dict>
               <key>pattern</key>
               <string>%RECIPE_CACHE_DIR%/%VENDOR%/*.pkg</string>
            </dict>
            <key>Processor</key>
            <string>FileFinder</string>
         </dict>
         <dict>
            <key>Processor</key>
            <string>PkgCopier</string>
            <key>Arguments</key>
            <dict>
               <key>source_pkg</key>
               <string>%found_filename%</string>
               <key>pkg_path</key>
               <string>%RECIPE_CACHE_DIR%/%VENDOR%_%SOFTWARETITLE%_%version%.pkg</string>
            </dict>
         </dict>
         <dict>
            <key>Processor</key>
            <string>PathDeleter</string>
            <key>Arguments</key>
            <dict>
               <key>path_list</key>
               <array>
                  <string>%RECIPE_CACHE_DIR%/%VENDOR%</string>
               </array>
            </dict>
         </dict>
      </array>
   </dict>
</plist>