<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
   <dict>
      <key>Description</key>
      <string>Downloads the latest version of iTerm2 and creates an installer package.</string>
      <key>Identifier</key>
      <string>corp.sap.maccoe.pkg.iTerm2</string>
      <key>Input</key>
      <dict>
         <key>NAME</key>
         <string>iTerm2</string>
         <key>PACKAGER</key>
         <string>SAPCorp</string>
         <key>SOFTWARETITLE</key>
         <string>iTerm2</string>
      </dict>
      <key>MinimumVersion</key>
      <string>1.0.0</string>
      <key>ParentRecipe</key>
      <string>io.github.hjuutilainen.download.iTerm2</string>
      <key>Process</key>
      <array>
         <dict>
            <key>Processor</key>
            <string>PkgRootCreator</string>
            <key>Arguments</key>
            <dict>
               <key>pkgroot</key>
               <string>%RECIPE_CACHE_DIR%/%SOFTWARETITLE%</string>
               <key>pkgdirs</key>
               <dict>
                  <key>Applications</key>
                  <string>0755</string>
               </dict>
            </dict>
         </dict>
         <dict>
            <key>Processor</key>
            <string>Unarchiver</string>
            <key>Arguments</key>
            <dict>
               <key>archive_format</key>
               <string>zip</string>
               <key>archive_path</key>
               <string>%pathname%</string>
               <key>destination_path</key>
               <string>%pkgroot%/Applications</string>
               <key>purge_destination</key>
               <true />
            </dict>
         </dict>
         <dict>
            <key>Processor</key>
            <string>PlistReader</string>
            <key>Arguments</key>
            <dict>
               <key>info_path</key>
               <string>%pkgroot%/Applications/iTerm.app</string>
               <key>plist_keys</key>
               <dict>
                  <key>CFBundleShortVersionString</key>
                  <string>version</string>
                  <key>CFBundleIdentifier</key>
                  <string>bundleid</string>
                  <key>CFBundleName</key>
                  <string>app_name</string>
               </dict>
            </dict>
         </dict>
         <dict>
            <key>Processor</key>
            <string>PkgCreator</string>
            <key>Arguments</key>
            <dict>
               <key>pkgname</key>
               <string>%PACKAGER%_%SOFTWARETITLE%_%version%</string>
               <key>pkg_request</key>
               <dict>
                  <key>version</key>
                  <string>%version%</string>
                  <key>id</key>
                  <string>%bundleid%</string>
                  <key>options</key>
                  <string>purge_ds_store</string>
                  <key>chown</key>
                  <array>
                     <dict>
                        <key>path</key>
                        <string>Applications</string>
                        <key>user</key>
                        <string>root</string>
                        <key>group</key>
                        <string>wheel</string>
                     </dict>
                  </array>
               </dict>
            </dict>
         </dict>
         <dict>
            <key>Arguments</key>
            <dict>
               <key>path_list</key>
               <array>
                  <string>%RECIPE_CACHE_DIR%/%SOFTWARETITLE%</string>
               </array>
            </dict>
            <key>Processor</key>
            <string>PathDeleter</string>
         </dict>
      </array>
   </dict>
</plist>